K6/results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6-script.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m10s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 1m40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/20 VUs  0m01.0s/1m40.0s

running (0m02.0s), 02/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 02/20 VUs  0m02.0s/1m40.0s

running (0m03.0s), 02/20 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 02/20 VUs  0m03.0s/1m40.0s

running (0m04.0s), 03/20 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 03/20 VUs  0m04.0s/1m40.0s

running (0m05.0s), 04/20 VUs, 2 complete and 0 interrupted iterations
default   [   5% ] 04/20 VUs  0m05.0s/1m40.0s

running (0m06.0s), 04/20 VUs, 3 complete and 0 interrupted iterations
default   [   6% ] 04/20 VUs  0m06.0s/1m40.0s

running (0m07.0s), 05/20 VUs, 4 complete and 0 interrupted iterations
default   [   7% ] 05/20 VUs  0m07.0s/1m40.0s

running (0m08.0s), 06/20 VUs, 6 complete and 0 interrupted iterations
default   [   8% ] 06/20 VUs  0m08.0s/1m40.0s

running (0m09.0s), 06/20 VUs, 8 complete and 0 interrupted iterations
default   [   9% ] 06/20 VUs  0m09.0s/1m40.0s

running (0m10.0s), 07/20 VUs, 9 complete and 0 interrupted iterations
default   [  10% ] 07/20 VUs  0m10.0s/1m40.0s

running (0m11.0s), 07/20 VUs, 12 complete and 0 interrupted iterations
default   [  11% ] 07/20 VUs  0m11.0s/1m40.0s

running (0m12.0s), 08/20 VUs, 14 complete and 0 interrupted iterations
default   [  12% ] 08/20 VUs  0m12.0s/1m40.0s

running (0m13.0s), 09/20 VUs, 16 complete and 0 interrupted iterations
default   [  13% ] 09/20 VUs  0m13.0s/1m40.0s

running (0m14.0s), 09/20 VUs, 20 complete and 0 interrupted iterations
default   [  14% ] 09/20 VUs  0m14.0s/1m40.0s

running (0m15.0s), 10/20 VUs, 24 complete and 0 interrupted iterations
default   [  15% ] 10/20 VUs  0m15.0s/1m40.0s

running (0m16.0s), 11/20 VUs, 37 complete and 0 interrupted iterations
default   [  16% ] 11/20 VUs  0m16.0s/1m40.0s

running (0m17.0s), 11/20 VUs, 40 complete and 0 interrupted iterations
default   [  17% ] 11/20 VUs  0m17.0s/1m40.0s

running (0m18.0s), 12/20 VUs, 40 complete and 0 interrupted iterations
default   [  18% ] 12/20 VUs  0m18.0s/1m40.0s

running (0m19.0s), 13/20 VUs, 49 complete and 0 interrupted iterations
default   [  19% ] 13/20 VUs  0m19.0s/1m40.0s

running (0m20.0s), 13/20 VUs, 51 complete and 0 interrupted iterations
default   [  20% ] 13/20 VUs  0m20.0s/1m40.0s

running (0m21.0s), 14/20 VUs, 52 complete and 0 interrupted iterations
default   [  21% ] 14/20 VUs  0m21.0s/1m40.0s

running (0m22.0s), 14/20 VUs, 70 complete and 0 interrupted iterations
default   [  22% ] 14/20 VUs  0m22.0s/1m40.0s

running (0m23.0s), 15/20 VUs, 81 complete and 0 interrupted iterations
default   [  23% ] 15/20 VUs  0m23.0s/1m40.0s

running (0m24.0s), 16/20 VUs, 100 complete and 0 interrupted iterations
default   [  24% ] 16/20 VUs  0m24.0s/1m40.0s

running (0m25.0s), 16/20 VUs, 123 complete and 0 interrupted iterations
default   [  25% ] 16/20 VUs  0m25.0s/1m40.0s

running (0m26.0s), 17/20 VUs, 142 complete and 0 interrupted iterations
default   [  26% ] 17/20 VUs  0m26.0s/1m40.0s

running (0m27.0s), 18/20 VUs, 144 complete and 0 interrupted iterations
default   [  27% ] 18/20 VUs  0m27.0s/1m40.0s

running (0m28.0s), 18/20 VUs, 144 complete and 0 interrupted iterations
default   [  28% ] 18/20 VUs  0m28.0s/1m40.0s

running (0m29.0s), 19/20 VUs, 159 complete and 0 interrupted iterations
default   [  29% ] 19/20 VUs  0m29.0s/1m40.0s

running (0m30.0s), 19/20 VUs, 165 complete and 0 interrupted iterations
default   [  30% ] 19/20 VUs  0m30.0s/1m40.0s

running (0m31.0s), 20/20 VUs, 196 complete and 0 interrupted iterations
default   [  31% ] 20/20 VUs  0m31.0s/1m40.0s

running (0m32.0s), 20/20 VUs, 219 complete and 0 interrupted iterations
default   [  32% ] 20/20 VUs  0m32.0s/1m40.0s

running (0m33.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  33% ] 20/20 VUs  0m33.0s/1m40.0s

running (0m34.0s), 20/20 VUs, 266 complete and 0 interrupted iterations
default   [  34% ] 20/20 VUs  0m34.0s/1m40.0s

running (0m35.0s), 20/20 VUs, 296 complete and 0 interrupted iterations
default   [  35% ] 20/20 VUs  0m35.0s/1m40.0s

running (0m36.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  36% ] 20/20 VUs  0m36.0s/1m40.0s

running (0m37.0s), 20/20 VUs, 321 complete and 0 interrupted iterations
default   [  37% ] 20/20 VUs  0m37.0s/1m40.0s

running (0m38.0s), 20/20 VUs, 321 complete and 0 interrupted iterations
default   [  38% ] 20/20 VUs  0m38.0s/1m40.0s

running (0m39.0s), 20/20 VUs, 339 complete and 0 interrupted iterations
default   [  39% ] 20/20 VUs  0m39.0s/1m40.0s

running (0m40.0s), 20/20 VUs, 361 complete and 0 interrupted iterations
default   [  40% ] 20/20 VUs  0m40.0s/1m40.0s

running (0m41.0s), 20/20 VUs, 381 complete and 0 interrupted iterations
default   [  41% ] 20/20 VUs  0m41.0s/1m40.0s

running (0m42.0s), 20/20 VUs, 406 complete and 0 interrupted iterations
default   [  42% ] 20/20 VUs  0m42.0s/1m40.0s

running (0m43.0s), 20/20 VUs, 434 complete and 0 interrupted iterations
default   [  43% ] 20/20 VUs  0m43.0s/1m40.0s

running (0m44.0s), 20/20 VUs, 459 complete and 0 interrupted iterations
default   [  44% ] 20/20 VUs  0m44.0s/1m40.0s

running (0m45.0s), 20/20 VUs, 473 complete and 0 interrupted iterations
default   [  45% ] 20/20 VUs  0m45.0s/1m40.0s

running (0m46.0s), 20/20 VUs, 490 complete and 0 interrupted iterations
default   [  46% ] 20/20 VUs  0m46.0s/1m40.0s

running (0m47.0s), 20/20 VUs, 496 complete and 0 interrupted iterations
default   [  47% ] 20/20 VUs  0m47.0s/1m40.0s

running (0m48.0s), 20/20 VUs, 496 complete and 0 interrupted iterations
default   [  48% ] 20/20 VUs  0m48.0s/1m40.0s

running (0m49.0s), 20/20 VUs, 510 complete and 0 interrupted iterations
default   [  49% ] 20/20 VUs  0m49.0s/1m40.0s

running (0m50.0s), 20/20 VUs, 536 complete and 0 interrupted iterations
default   [  50% ] 20/20 VUs  0m50.0s/1m40.0s

running (0m51.0s), 20/20 VUs, 556 complete and 0 interrupted iterations
default   [  51% ] 20/20 VUs  0m51.0s/1m40.0s

running (0m52.0s), 20/20 VUs, 581 complete and 0 interrupted iterations
default   [  52% ] 20/20 VUs  0m52.0s/1m40.0s

running (0m53.0s), 20/20 VUs, 609 complete and 0 interrupted iterations
default   [  53% ] 20/20 VUs  0m53.0s/1m40.0s

running (0m54.0s), 20/20 VUs, 636 complete and 0 interrupted iterations
default   [  54% ] 20/20 VUs  0m54.0s/1m40.0s

running (0m55.0s), 20/20 VUs, 656 complete and 0 interrupted iterations
default   [  55% ] 20/20 VUs  0m55.0s/1m40.0s

running (0m56.0s), 20/20 VUs, 682 complete and 0 interrupted iterations
default   [  56% ] 20/20 VUs  0m56.0s/1m40.0s

running (0m57.0s), 20/20 VUs, 688 complete and 0 interrupted iterations
default   [  57% ] 20/20 VUs  0m57.0s/1m40.0s

running (0m58.0s), 20/20 VUs, 688 complete and 0 interrupted iterations
default   [  58% ] 20/20 VUs  0m58.0s/1m40.0s

running (0m59.0s), 20/20 VUs, 704 complete and 0 interrupted iterations
default   [  59% ] 20/20 VUs  0m59.0s/1m40.0s

running (1m00.0s), 20/20 VUs, 727 complete and 0 interrupted iterations
default   [  60% ] 20/20 VUs  1m00.0s/1m40.0s

running (1m01.0s), 20/20 VUs, 748 complete and 0 interrupted iterations
default   [  61% ] 20/20 VUs  1m01.0s/1m40.0s

running (1m02.0s), 20/20 VUs, 770 complete and 0 interrupted iterations
default   [  62% ] 20/20 VUs  1m02.0s/1m40.0s

running (1m03.0s), 20/20 VUs, 798 complete and 0 interrupted iterations
default   [  63% ] 20/20 VUs  1m03.0s/1m40.0s

running (1m04.0s), 20/20 VUs, 826 complete and 0 interrupted iterations
default   [  64% ] 20/20 VUs  1m04.0s/1m40.0s

running (1m05.0s), 20/20 VUs, 849 complete and 0 interrupted iterations
default   [  65% ] 20/20 VUs  1m05.0s/1m40.0s

running (1m06.0s), 20/20 VUs, 870 complete and 0 interrupted iterations
default   [  66% ] 20/20 VUs  1m06.0s/1m40.0s

running (1m07.0s), 20/20 VUs, 879 complete and 0 interrupted iterations
default   [  67% ] 20/20 VUs  1m07.0s/1m40.0s

running (1m08.0s), 20/20 VUs, 879 complete and 0 interrupted iterations
default   [  68% ] 20/20 VUs  1m08.0s/1m40.0s

running (1m09.0s), 20/20 VUs, 893 complete and 0 interrupted iterations
default   [  69% ] 20/20 VUs  1m09.0s/1m40.0s

running (1m10.0s), 20/20 VUs, 912 complete and 0 interrupted iterations
default   [  70% ] 20/20 VUs  1m10.0s/1m40.0s

running (1m11.0s), 20/20 VUs, 939 complete and 0 interrupted iterations
default   [  71% ] 20/20 VUs  1m11.0s/1m40.0s

running (1m12.0s), 20/20 VUs, 962 complete and 0 interrupted iterations
default   [  72% ] 20/20 VUs  1m12.0s/1m40.0s

running (1m13.0s), 20/20 VUs, 984 complete and 0 interrupted iterations
default   [  73% ] 20/20 VUs  1m13.0s/1m40.0s

running (1m14.0s), 20/20 VUs, 1014 complete and 0 interrupted iterations
default   [  74% ] 20/20 VUs  1m14.0s/1m40.0s

running (1m15.0s), 20/20 VUs, 1039 complete and 0 interrupted iterations
default   [  75% ] 20/20 VUs  1m15.0s/1m40.0s

running (1m16.0s), 20/20 VUs, 1062 complete and 0 interrupted iterations
default   [  76% ] 20/20 VUs  1m16.0s/1m40.0s

running (1m17.0s), 20/20 VUs, 1063 complete and 0 interrupted iterations
default   [  77% ] 20/20 VUs  1m17.0s/1m40.0s

running (1m18.0s), 20/20 VUs, 1063 complete and 0 interrupted iterations
default   [  78% ] 20/20 VUs  1m18.0s/1m40.0s

running (1m19.0s), 20/20 VUs, 1083 complete and 0 interrupted iterations
default   [  79% ] 20/20 VUs  1m19.0s/1m40.0s

running (1m20.0s), 20/20 VUs, 1094 complete and 0 interrupted iterations
default   [  80% ] 20/20 VUs  1m20.0s/1m40.0s

running (1m21.0s), 20/20 VUs, 1121 complete and 0 interrupted iterations
default   [  81% ] 20/20 VUs  1m21.0s/1m40.0s

running (1m22.0s), 20/20 VUs, 1147 complete and 0 interrupted iterations
default   [  82% ] 20/20 VUs  1m22.0s/1m40.0s

running (1m23.0s), 20/20 VUs, 1173 complete and 0 interrupted iterations
default   [  83% ] 20/20 VUs  1m23.0s/1m40.0s

running (1m24.0s), 20/20 VUs, 1198 complete and 0 interrupted iterations
default   [  84% ] 20/20 VUs  1m24.0s/1m40.0s

running (1m25.0s), 20/20 VUs, 1223 complete and 0 interrupted iterations
default   [  85% ] 20/20 VUs  1m25.0s/1m40.0s

running (1m26.0s), 20/20 VUs, 1248 complete and 0 interrupted iterations
default   [  86% ] 20/20 VUs  1m26.0s/1m40.0s

running (1m27.0s), 20/20 VUs, 1255 complete and 0 interrupted iterations
default   [  87% ] 20/20 VUs  1m27.0s/1m40.0s

running (1m28.0s), 20/20 VUs, 1255 complete and 0 interrupted iterations
default   [  88% ] 20/20 VUs  1m28.0s/1m40.0s

running (1m29.0s), 20/20 VUs, 1268 complete and 0 interrupted iterations
default   [  89% ] 20/20 VUs  1m29.0s/1m40.0s

running (1m30.0s), 20/20 VUs, 1293 complete and 0 interrupted iterations
default   [  90% ] 20/20 VUs  1m30.0s/1m40.0s

running (1m31.0s), 19/20 VUs, 1315 complete and 0 interrupted iterations
default   [  91% ] 19/20 VUs  1m31.0s/1m40.0s

running (1m32.0s), 17/20 VUs, 1339 complete and 0 interrupted iterations
default   [  92% ] 17/20 VUs  1m32.0s/1m40.0s

running (1m33.0s), 15/20 VUs, 1362 complete and 0 interrupted iterations
default   [  93% ] 15/20 VUs  1m33.0s/1m40.0s

running (1m34.0s), 13/20 VUs, 1381 complete and 0 interrupted iterations
default   [  94% ] 13/20 VUs  1m34.0s/1m40.0s

running (1m35.0s), 12/20 VUs, 1395 complete and 0 interrupted iterations
default   [  95% ] 12/20 VUs  1m35.0s/1m40.0s

running (1m36.0s), 09/20 VUs, 1412 complete and 0 interrupted iterations
default   [  96% ] 09/20 VUs  1m36.0s/1m40.0s

running (1m37.0s), 09/20 VUs, 1416 complete and 0 interrupted iterations
default   [  97% ] 09/20 VUs  1m37.0s/1m40.0s

running (1m38.0s), 09/20 VUs, 1416 complete and 0 interrupted iterations
default   [  98% ] 09/20 VUs  1m38.0s/1m40.0s

running (1m39.0s), 04/20 VUs, 1423 complete and 0 interrupted iterations
default   [  99% ] 04/20 VUs  1m39.0s/1m40.0s

running (1m40.0s), 03/20 VUs, 1425 complete and 0 interrupted iterations
default   [ 100% ] 03/20 VUs  1m40.0s/1m40.0s

running (1m41.0s), 03/20 VUs, 1425 complete and 0 interrupted iterations
default ↓ [ 100% ] 03/20 VUs  1m40s


  █ TOTAL RESULTS 

    checks_total.......: 42163  413.946361/s
    checks_succeeded...: 61.27% 25836 out of 42163
    checks_failed......: 38.72% 16327 out of 42163

    ✗ Status code is 200
      ↳  40% — ✓ 3405 / ✗ 5017
    ✗ Response time is less than 1000ms
      ↳  99% — ✓ 7147 / ✗ 2
    ✗ Access Token is present and valid
      ↳  15% — ✓ 227 / ✗ 1201
    ✗ User data is correct (Emily Johnson)
      ↳  15% — ✓ 227 / ✗ 1201
    ✗ Response schema is valid
      ↳  15% — ✓ 227 / ✗ 1201
    ✗ Status code is 200 - Login Successful
      ↳  14% — ✓ 205 / ✗ 1223
    ✗ Check Critical Fields: ID, Username, and Role
      ↳  14% — ✓ 205 / ✗ 1223
    ✗ Data Types Validation
      ↳  14% — ✓ 205 / ✗ 1223
    ✗ Check if New Tokens exist
      ↳  0% — ✓ 0 / ✗ 1428
    ✓ Response time is less than 1000msms
    ✓ Check if users array is returned
    ✗ Response time is less than 1000ms00ms
      ↳  99% — ✓ 1427 / ✗ 1
    ✗ Verify User data
      ↳  17% — ✓ 250 / ✗ 1178
    ✗ ID is a number
      ↳  17% — ✓ 250 / ✗ 1178
    ✓ All returned users should have the name Michael
    ✓ Verify pagination fields exist
    ✓ Ensure first result has Admin role
    ✓ Total users found matches limit in this result
    ✓ Verify all users are female
    ✓ Check bank currency exists
    ✗ Successfully created user
      ↳  88% — ✓ 216 / ✗ 29
    ✗ Response contains new user ID
      ↳  88% — ✓ 216 / ✗ 29
    ✗ Verify returned name matches input
      ↳  88% — ✓ 216 / ✗ 29
    ✗ Status code is 200 - Request Successful
      ↳  86% — ✓ 211 / ✗ 34
    ✗ User Identity: Emily Janajreh with Admin Role
      ↳  86% — ✓ 211 / ✗ 34
    ✗ Physical Attributes: Eye Color & Blood Group
      ↳  86% — ✓ 211 / ✗ 34
    ✗ Data Quality: Height/Weight are Numbers
      ↳  86% — ✓ 211 / ✗ 34
    ✓ Employment: Engineering Dept in Phoenix
    ✓ Bank Info: Currency is GBP
    ✗ User deleted
      ↳  96% — ✓ 203 / ✗ 8
    ✓ Status code is 200 OK
    ✓ Response is valid JSON and contains products
    ✓ Validate first product details (Mascara)
    ✓ Verify product categories are correct
    ✓ Check if products have valid reviews
    ✓ Response time is less than 800ms
    ✓ Search results are relevant
    ✓ Products have essential fields
    ✓ Product created successfully
    ✗ Product updated successfully
      ↳  99% — ✓ 199 / ✗ 2
    ✗ Price patched successfully
      ↳  97% — ✓ 196 / ✗ 5
    ✗ Confirm product deletion
      ↳  98% — ✓ 197 / ✗ 4
    ✓ Product total matches (Price * Quantity)
    ✓ Cart grand total is sum of all product totals
    ✓ Discounted total is less than original total
    ✓ Check essential fields exist
    ✓ Total quantity matches sum of individual quantities
    ✗ Status code is Success
      ↳  98% — ✓ 191 / ✗ 3
    ✗ Cart created with unique ID
      ↳  98% — ✓ 191 / ✗ 3
    ✗ Response contains correct number of products
      ↳  98% — ✓ 191 / ✗ 3
    ✓ Server calculated totals correctly
    ✓ User ID matches request
    ✓ Product quantity updated to 10
    ✓ Cart total is recalculated correctly
    ✓ Status code is 200 or 204
    ✓ Confirm cart is deleted
    ✓ Deleted ID matches the requested ID

    HTTP
    http_req_duration..............: avg=135.58ms min=8.18ms  med=145.01ms max=1.04s    p(90)=162.81ms p(95)=174.12ms
      { expected_response:true }...: avg=114.72ms min=8.18ms  med=145.57ms max=414.38ms p(90)=164.86ms p(95)=173.94ms
    http_req_failed................: 54.76% 6320 out of 11541
    http_reqs......................: 11541  113.306808/s

    EXECUTION
    iteration_duration.............: avg=1.13s    min=742.8ms med=794.02ms max=3.75s    p(90)=2.87s    p(95)=2.95s   
    iterations.....................: 1428   14.019766/s
    vus............................: 3      min=1             max=20
    vus_max........................: 20     min=20            max=20

    NETWORK
    data_received..................: 102 MB 1.0 MB/s
    data_sent......................: 1.7 MB 16 kB/s



running (1m41.9s), 00/20 VUs, 1428 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/20 VUs  1m40s